/**
 * Урок 6, задание 2
 * Создать массив типа double с размером 4.
 * Записать в него любые значения с помощью блока для инициализации.
 * Вывести на консоль значение первого элемента.
 */

package com.company;

public class MassivDouble {
    public static void main(String[] args) {
        double[] mas = {2.343, 5.543, 3.564, 7.653};
        System.out.println("Значение первого элемента - " + mas[0]);
    }
}