package lesson7;

import java.util.Scanner;

/**
 * Урок 7, задание 5
 * Создать двухмерный массив 5х8 и инициализировать его с помощью блока для инициализации.
 * Найти максимальное и минимальное значение в каждой "строке" и записать эти значения в двухмерный массив 5х2.
 * Распечатать оба массива.
 */

public class Matrix {
    public static void main(String[] args) {
        Scanner m = new Scanner(System.in);
        //int[][] matrix = new int[5][8];
        //matrix = Integer.parseInt(args[5][8]);
        System.out.println("Mассив числел 5х8.");
        for (int i=0; i<5; i++){
            for (int j=0; j<8; j++){
                //int matrix[][] = m.nextInt();
                //System.out.println(matrix[i][j]);
            }
        }

       /* for (int i=0; i<5; i++){

            for (int j=0; j<8; j++){
                System.out.println(matrix[i][j]);
            }
        }
*/
    }
}
